Documents/ЗаявлениеНаАкрредитив.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Document>
		<Properties>
			<Name>ЗаявлениеНаАкрредитив</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>БанкКорреспондент</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БанковскийСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БанковскийСчетБенефициара</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Безотзывной</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Бенефициар</Name>
					<Comment>Бенефициар</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Воздух</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Выписка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Делимый</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДнейДоПоследнейОтгрузки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорБенефициара</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеПоставки</Name>
					<Comment>Описание поставки</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Перегрузка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подтвержденный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокАккредитива</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Comment>Сумма</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДляКомиссии</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДляПокрытияАккредитива</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Телеграф</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Трансферабельный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЧастичныеОтгрузки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПервойОтгрузки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеБенефициара</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеСчетаБенефициара</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеТранспортировки</Name>
					<Comment>Назначение платежа</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеОрганизации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтгрузочныеРеквизиты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПаспортИмпортнойСделки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокПредставленияДокументов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПереченьДокументов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Описание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ЗаявлениеНаАкрредитив/Ext/ObjectModule.bsl
Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	ДобавитьПрефиксУзла(Префикс);
КонецПроцедуры

Функция ПолучитьСтруктуруПечатныхФорм() Экспорт
	
	Возврат Новый Структура("ЗаявлениеНаАккредитив","Заявление на аккредитив");
	
КонецФункции

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
КонецПроцедуры

Функция ПечатьППвалютное()
	ТабДок = Новый ТабличныйДокумент;
	
	Макет = ПолучитьМакет("ЗаявлениеНаАккредитив");
	
	Руководители = ОтветственныеЛица(Организация, Дата);	
	Область = Макет.ПолучитьОбласть("Аккредитив1");
	
	Область.Параметры.Номер = ПолучитьНомерНаПечать(ЭтотОбъект);
	
	Если БанковскийСчет.МесяцПрописью Тогда
		Область.Параметры.Дата = Формат(Дата,"ДЛФ=DD");
	Иначе
		Область.Параметры.Дата = Формат(Дата,"ДЛФ=D")+" г.";
	КонецЕсли; 	
	
	Область.Параметры.Заполнить(Руководители);
	Область.Параметры.Организация=СокрЛП(Организация);
	Область.Параметры.ОписаниеОрганизации = СокрЛП(ОписаниеОрганизации);
	Область.Параметры.ОписаниеБенефициара=СокрЛП(ОписаниеБенефициара);
	
	Если Телеграф Тогда
		Область.Параметры.Телеграф="Х";
	Иначе 
		Область.Параметры.Телеграф=" ";
	КонецЕсли;	
	
	Если Воздух Тогда
		Область.Параметры.Воздух="Х";
	Иначе
		Область.Параметры.Воздух=" ";
	КонецЕсли;	
	
	Если Безотзывной Тогда
		Область.Параметры.Безотзывной="Х";
	Иначе 
		Область.Параметры.Безотзывной=" ";
	КонецЕсли;	
	
	Если Трансферабельный Тогда
		Область.Параметры.Трансферабельный="Х";
	Иначе 
		Область.Параметры.Трансферабельный=" ";
	КонецЕсли;	
	
	Если Делимый Тогда
		Область.Параметры.Делимый="Х";
	Иначе 
		Область.Параметры.Делимый=" ";
	КонецЕсли;
	
	Если Подтвержденный Тогда
		Область.Параметры.Подтвержденный="Х";
	Иначе 
		Область.Параметры.Подтвержденный=" ";
	КонецЕсли;	
	
	Если ЧастичныеОтгрузки Тогда
		Область.Параметры.ОтгрузкиРазрешено="Х";
		Область.Параметры.ОтгрузкиНеРазрешено=" ";
	Иначе
		Область.Параметры.ОтгрузкиРазрешено=" ";
		Область.Параметры.ОтгрузкиНеРазрешено="Х";
	КонецЕсли;
	
	Если Перегрузка Тогда
		Область.Параметры.ПерегрузкаРазрешено="Х";
		Область.Параметры.ПерегрузкаНеРазрешено=" ";
	Иначе
		Область.Параметры.ПерегрузкаРазрешено=" ";
		Область.Параметры.ПерегрузкаНеРазрешено="Х";
	КонецЕсли;
	
	Область.Параметры.ДнейАккредитива=СрокАккредитива;
	Область.Параметры.Сумма = Формат(Сумма,"ЧЦ=18; ЧДЦ=2; ЧРД=.; ЧРГ=");
	Область.Параметры.Валюта=Валюта;
	Область.Параметры.СуммаПрописью = СформироватьСуммуПрописью(Сумма,Валюта);
	
	Область.Параметры.ОтгрузочныеРеквизиты=СокрЛП(ОтгрузочныеРеквизиты);
	Область.Параметры.ОписаниеТранспортировки=СокрЛП(ОписаниеТранспортировки);
	Область.Параметры.ОписаниеПоставки=СокрЛП(ОписаниеПоставки);
	
	ТабДок.Вывести(Область);
	
	Область = Макет.ПолучитьОбласть("Строка");
	Для Каждого СтрокаПереченьДокументов из ПереченьДокументов  Цикл
		Область.Параметры.Заполнить(СтрокаПереченьДокументов);
		Область.Параметры.ОписаниеДокумента=СокрЛП(СтрокаПереченьДокументов.Описание);
		ТабДок.Вывести(Область);
	КонецЦикла;
	
	Область = Макет.ПолучитьОбласть("Аккредитив2");
	Область.Параметры.ПаспортИмпортнойСделки=СокрЛП(ПаспортИмпортнойСделки);
	Область.Параметры.ДатаПервойОтгрузки=Формат(ДатаПервойОтгрузки,"ДФ=dd.MM.yyyy");;
	Область.Параметры.ДнейДоПоследнейОтгрузки=ДнейДоПоследнейОтгрузки;
	Область.Параметры.СрокПредставленияДокументов=СрокПредставленияДокументов;
	Область.Параметры.ОписаниеСчетаКомиссии=СокрЛП(СчетДляКомиссии);
	Область.Параметры.ОписаниеСчетаПокрытияАккредитива=СокрЛП(СчетДляПокрытияАккредитива);

	Область.Параметры.Заполнить(Руководители);
	ТабДок.Вывести(Область);
	
	ТабДок.ЭкземпляровНаСтранице=1;
	ТабДок.ТолькоПросмотр = Истина;
	
	Возврат ТабДок;
КонецФункции

Процедура Печать(ИмяМакета, КоличествоЭкземпляров = 1, НаПринтер = Ложь, НепосредственнаяПечать = Ложь) Экспорт
	
	ТабДокумент = ПечатьППвалютное();
		
	НапечататьДокумент(ТабДокумент, КоличествоЭкземпляров, НаПринтер, "Плат. пор.валютное");
	
КонецПроцедуры // Печать()
